ag1357/AetherSparse/firmware/p4_aethercore/sdkconfig.defaults
# ESP32-P4 physical qualification defaults (ESP-IDF v5.5.1).
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# HEX PSRAM (32 MB class on the accessory board). ESP32-P4 supports HEX mode
# only; 80 MHz is the fastest non-experimental speed in IDF v5.5.1 (200 MHz is
# gated behind IDF_EXPERIMENTAL_FEATURES and stays out of scope).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# ESP32-P4 supports exactly one production CPU clock in IDF v5.5.1: 360 MHz
# (40 MHz is FPGA bring-up only). The 200/300/400 MHz figures in the V14
# references are analytical; Phase 9 measures at the physical 360 MHz and
# interpolates for comparison, documented as such.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000

# Main task carries the parity runner plus the SD phases (deep local frames
# for gram/padded buffers and scoring chunks). Measured high-water margin was
# 140 B at 12288 during the phase-6 replay; 16384 restores sane headroom.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# FAT + SDMMC for the knowledge pack and trace bundle. FS_LOCK must be 0:
# all pack IO happens on the main task, and the FatFs file-lock pool otherwise
# caps concurrent opens to the lock count (3rd open -> ENFILE).
CONFIG_FATFS_VOLUME_COUNT=2
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_FS_LOCK=0

# Long storage phases yield explicitly; keep the watchdog horizon generous.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# --- Option A transport (2026-08-26 gate): hosted factory-C6 softAP + TCP ---
# Larger app partition: the hosted + wifi_remote + sockets stack grows the
# image past the 1 MiB single-app partition.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Identical hosted component configuration to the known-working Device A
# Tactility build and the verified p4_c6_probe (SDIO slot 1, C6 reset on
# P4 GPIO54). No BT on Device B (no BLE consumer there).
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_PRIV_SDIO_OPTION=y
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=18
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=19
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=14
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=15
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=16
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=17
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=54
CONFIG_ESP_HOSTED_ENABLE_PEER_DATA_TRANSFER=y
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
